[
  {
    "name": "Simple Mac and Cheese",
    "description": "Quick, easy, and tasty macaroni and cheese dish",
    "ingredients": ["1 (8 ounce) box elbow macaroni", "1\/4 cup butter", "1\/4cup all-purpose flour", "1\/2 teaspoon salt", "Ground black pepper to taste", "2 cups of milk", "2 cups of shredded Cheddar cheese"],
    "instructions": ["1. Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes.", "2. At the same time, melt butter in a saucepan over medium heat. Add flour, salt, and pepper and stir until smooth, about 5 minutes. Pour in milk slowly, while stirring continuously. Continue to cook and stir until mixture is smooth and bubbling, about 5 minutes, making sure the milk doesn't burn.", "3. Add Cheddar cheese and stir until melted, 2 to 4 minutes.", "4. Drain macaroni and fold into cheese sauce until coated."]
  },

  {
    "name" : "Grilled Cheese Sandwhich",
    "description" : "Bread, butter and Cheddar cheese - here's a way to make this classic sandwich in a nonstick pan",
    "ingredients": ["4 slices of white bread", "3 tablespoons of butter", "2 slices of Cheddar cheese"],
    "instructions": ["1. Preheat skillet over medium heat. Generously butter one side of a slice of bread.", "2. Place bread butter-side-down onto skillet bottom and add 1 slice of cheese.", "3. Butter a second slice of bread on one side and place butter-side-up on top of sandwich.", "3. Butter a second slice of bread on one side and place butter-side-up on top of sandwich.", "4. Grill until lightly browned and flip over; continue grilling until cheese is melted. Repeat with remaining 2 slices of bread, butter and slice of cheese."]
  },

  {
    "name": "Simple Baked Chicken Breasts",
    "description": "Bake chicken that's tender, juicy, and perfect every time",
    "ingredients": ["4 (5 ounce) skinless, boneless chicken breast halves", "2 tablespoons olive oil", "1\/2 teaspoon coarse sea salt, or to taste", "1 pinch Creole seasoning (such as Tony Chachere's®), or more to taste", "1 tablespoon chicken broth, or more to taste"],
    "instructions": ["1. Preheat the oven to 400 degrees F (200 degrees C).", "2. Rub chicken breasts with olive oil and sprinkle both sides with salt and Creole seasoning. Place chicken in a broiler pan.", "3. Bake in the preheated oven for 10 minutes. Flip chicken and cook until no longer pink in the center and the juices run clear, about 15 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).", "4. Remove chicken to a plate.", "5. Pour chicken broth into the pan and scrape any browned bits off the bottom with a flat-edged wooden spatula. Add more broth if needed to dislodge the browned bits, but not too much or it will be watery.", "6. To serve, drizzle the pan sauce over the chicken."],
  }
]